Revit 2024 API
ModelPathUtils.ConvertCloudGUIDsToCloudPath Method
 Converts a pair of cloud project and model GUIDs to a valid cloud path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ModelPath ConvertCloudGUIDsToCloudPath(
	string region,
	Guid projectGuid,
	Guid modelGuid
)
Visual Basic
Public Shared Function ConvertCloudGUIDsToCloudPath ( _
	region As String, _
	projectGuid As Guid, _
	modelGuid As Guid _
) As ModelPath
Visual C++
public:
static ModelPath^ ConvertCloudGUIDsToCloudPath(
	String^ region,
	Guid projectGuid,
	Guid modelGuid
)
Parameters
region
Type: System.String
 The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model. Please see the reference values, like CloudRegionUS and CloudRegionEMEA, and the new regions from release note.
projectGuid
Type: System.Guid
 The GUID of the cloud project which contains the model.
modelGuid
Type: System.Guid
 The GUID of the Revit cloud model.
Return Value
 The cloud model path.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.CentralModelException |  The cloud project is missing.
Autodesk.Revit.Exceptions.RevitServerCommunicationException |  The central server could not be reached.
Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException |  You must sign in to Autodesk 360 in order to complete action.
Autodesk.Revit.Exceptions.RevitServerUnauthorizedException |  You are unauthorized to access this resource.
See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace